/***********************************************************************
filename:   Timer.cpp
created:    25/01/2008
author:     이종현
***********************************************************************/
/***********************************************************************
*  Copyright (C) 2008 - 2010 이종현
*	
*	
***********************************************************************/
#include "stdafx.h"



/////////////////////////////////////////////////////////////////////////
//  Name : SetTimer
//	Desc : 시작 시간을 설정.
//	Data : 2008. 01. 25
//	Param :
//	Return :
//	Author : 이종현
/////////////////////////////////////////////////////////////////////////
void CTimer::SetTimer()
{
	QueryPerformanceCounter(&m_liCur);
	QueryPerformanceFrequency(&m_liFreq);
}
/////////////////////////////////////////////////////////////////////////



/////////////////////////////////////////////////////////////////////////
//  Name : GetElapsedTime
//	Desc : 이전 호출시간과의 시간차를 얻는다
//	Data : 2008. 01. 25
//	Param : void
//	Return : float
//	Author : 이종현
/////////////////////////////////////////////////////////////////////////
float CTimer::GetElapsedTime()
{
	m_liPre = m_liCur;
	QueryPerformanceCounter(&m_liCur);
	return (float) ((double(m_liCur.QuadPart - m_liPre.QuadPart)) / double(m_liFreq.QuadPart));
}
/////////////////////////////////////////////////////////////////////////